[
  {
    "id": 0,
    "name": "Adams v. Tanner,244 U.S. 590 (1917)",
    "year": 1916,
    "description": "A Washington law that proscribed private employment agencies by prohibiting them from collecting fees for their services deprived individuals of the liberty to pursue a lawful calling contrary to due process of law.",
    "title": "Adams v. Tanner",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep244/usrep244590/usrep244590.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep244590/",
    "scenario": "In the state, a law has been passed that forbids private employment agencies from charging any fees to job seekers for finding them employment or providing information leading to employment. This effectively forces many private employment agencies to shut down as they cannot sustain their business without these fees. The law aims to protect workers from exploitation and ensure their welfare. However, as the law stands, it intervenes in the functioning of a legitimate occupation, threatening the livelihoods of those who run such agencies.",
    "isLaw": "true"
  },
  {
    "id": 1,
    "name": "Roman v. Sincock,377 U.S. 695 (1964)",
    "year": 1963,
    "description": "Del. Const. Art II, § 2 (1897), as amended in 1963: Delaware constitutional provisions that provided for two-thirds of the state Senate to be elected by 31% of the state's residents.",
    "title": "Roman v. Sincock",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep377/usrep377695/usrep377695.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep244590/",
    "scenario": "In the state of Delacourt, an election for state legislature seats was about to take place under a new constitutional amendment. This amendment had increased the size of both the Senate and the House, but it maintained a significant disparity in the population-to-representative ratio. In the Senate, two-thirds of the members were chosen from districts where only 31% of the state's population resided. The House also faced a similar issue, where a majority of representatives would be selected from areas comprising only 28% of the population. This meant that voters in certain districts had a much more potent electoral voice than others, effectively diluting the votes of citizens in more populous areas.\n\nConcerned citizens, feeling underrepresented, filed a lawsuit against the state officials in charge of elections. They claimed the current apportionment violated their right to equal protection under the law by creating significantly unequal voting power amongst citizens, depending on where they lived. The case reached the highest court, where the main issue was whether the state's apportionment scheme for electing legislators was in line with the constitutional principle of equal representation for equal numbers of people.",
    "isLaw": "true"
  },
  {
    "id": 2,
    "name": "Power Manufacturing Co. v. Saunders,274 U.S. 490 (1927)",
    "year": 1926,
    "description": "1921 Crawford & Moses' Digest, §§ 1152, 1171, 1176, 1829:Arkansas state law requiring actions against domestic corporations to be brought only in counties where they do business or where chief officers resides. Actions against foreign corporations can be brought in any county in the state regardless of where they do business or where their chief officers reside.",
    "title": "Power Manufacturing Co. v. Saunders",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep274/usrep274490/usrep274490.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep244590/",
    "scenario": "In Arkansas, a local entrepreneur decided to sue a foreign toy manufacturing company for breach of contract. The entrepreneur, based in Little River County, filed the lawsuit in his home county despite the fact that the company only conducted business and had its sole office and representatives in Pulaski County, over 140 miles away. The company protested, arguing that the state law allowing them to be sued in any county, even where they had no presence, was unfair and placed an undue burden on them as opposed to domestic corporations and individuals who were protected from such statewide lawsuits. The company asserted that this practice violated their Fourteenth Amendment rights by denying them equal protection of the laws. However, the local court decided to proceed with the case, ignoring the constitutional challenge raised by the foreign corporation.",
    "isLaw": "true"
  },
  {
    "id": 3,
    "name": "Perry v. United States,294 U.S. 330 (1935)",
    "year": 1934,
    "description": "31 U.S.C. §§ 462-63 (1933): A Joint Resolution declaring that provisions requiring payment in gold or any particular kind of coin or currency are invalid and providing that any past or future obligation shall be discharged upon payment, dollar for dollar, in any coin or currency which at the time of payment is legal tender for public and private debts.",
    "title": "Perry v. United States",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep294/usrep294330/usrep294330.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "Amid economic turmoil, a new law is implemented declaring that any existing contracts with clauses mandating payment in gold are rendered null and void. Subsequently, all debts can be discharged with any form of legal tender, not just gold. A citizen, having a government bond with a gold clause, claims the intrinsic value of the gold exceeds the face value of the bond due to changes in the gold market. When the government refuses to honor the gold clause after a devaluation of the currency, the individual takes legal action, demanding compensation based on the original gold value stipulated in the bond contract. The government argues that the citizen has no right to claim loss based on the gold standard, as the newly passed law has altered the terms of their agreement.",
    "isLaw": "true"
  },
  {
    "id": 4,
    "name": "Bush v. Vera,517 U.S. 952 (1996)",
    "year": 1995,
    "description": "Texas congressional redistricting plan, promulgated after the 1990 census showed a population increase that entitled the state to three additional seats in Congress, that used race as the predominant factor in drawing new district lines.",
    "title": "Bush v. Vera",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep517/usrep517952/usrep517952.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In the state of Jefferson, a recent population census indicated significant growth, resulting in the state gaining additional representation in the national legislature. To address this change, the Jefferson Legislature embarked on redrawing the state's congressional districts. One district, nicknamed \"The Claw\" due to its unique shape, was created to include two non-contiguous urban areas with high minority populations, connected by a thin strip of land that ran through rural regions and over a river.\n\nThe boundary lines of \"The Claw\" were drawn to traverse varying elevations, split communities, and disregard both natural geographic features and existing political boundaries. The district's shape was neither compact nor regular, and it appeared as though the demographic data concerning race was the primary driver in its creation, overshadowing all traditional redistricting principles.\n\nCritics of the redistricting plan argued that \"The Claw\" was a clear example of gerrymandering based on racial composition, which they claimed undermined the principles of fair representation and equal protection under the law. This contention set the stage for a legal battle over the constitutionality of Jefferson's redistricting efforts.",
    "isLaw": "true"
  },
  {
    "id": 5,
    "name": "Osborn v. Bank of the United States,22 U.S. (9 Wheat.) 738 (1824)",
    "year": 1824,
    "description": "An Ohio statute levying a tax on the Bank of the United States, a federal instrumentality.",
    "title": "Osborn v. Bank of the United States",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep022/usrep022738/usrep022738.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In a small town, the state legislature recently passed a law requiring all banking institutions, including those federally chartered, to pay a hefty annual tax. The local branch of the National Bank, recognized and operated under federal law, faces a dilemma as the state tax auditor demands payment in compliance with the new state statute. The bank officials believe this state law infringes on their institution's functions as a federal entity. The state officials, on the other hand, are adamant that they hold the authority to tax any business operating within their borders. The National Bank decides to contest the state's demand in court, arguing that the state's attempt to levy the tax is unconstitutional and interferes with federal operations.",
    "isLaw": "true"
  },
  {
    "id": 6,
    "name": "Morrison v. California,291 U.S. 82 (1934)",
    "year": 1933,
    "description": "Section 9a of the California Alien Land Law, as amended in 1927, and Section 1983 of the California Code of Civil Procedure, which placed the burden of disproving guilt on a defendant by requiring him to prove that he was a U.S. citizen.",
    "title": "Morrison v. California",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep291/usrep291082/usrep291082.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In the state of California, a new law has been enacted that strictly prohibits non-citizens from occupying agricultural land. An individual known to be of Japanese descent has been actively farming on a piece of land he claims to own. The court finds him and his business partner guilty of violating the law based solely on the presumption of his ineligibility for citizenship due to his race, without any actual proof of his citizenship status. The individual is forced to prove his citizenship to avoid the conviction, but he struggles with this as his roots are intricate, blending various ancestries, making his exact status uncertain. He was never granted the opportunity to present his case as the law presumed his guilt from his appearance and association with the land, shifting the burden of proof upon him and his partner.",
    "isLaw": "true"
  },
  {
    "id": 7,
    "name": "Good News Club, v. Milford Central School,533 U.S. 98 (2001)",
    "year": 2000,
    "description": "School policy opening school to public use, but prohibiting use of school for religious purposes.",
    "title": "Good News Club",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep533/usrep533098/usrep533098.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In a small town, a local community center has a policy that allows residents to use its facilities for various educational and recreational activities but explicitly bans any events that are characterized as religious services or proselytizing. A group known as the \"Community Values Club,\" which promotes moral and character development for children from a specific religious standpoint, is denied access to the community center for their weekly meeting. They intended to include activities such as storytelling, moral lessons, and prayer in their sessions.\n\nThe Community Values Club files a lawsuit against the community center alleging that their free speech rights have been violated by being excluded from the community center due to the religious nature of their meetings.",
    "isLaw": "true"
  },
  {
    "id": 8,
    "name": "Coppage v. Kansas,236 U.S. 1 (1915)",
    "year": 1914,
    "description": "Kansas law proscribing “yellow dog” contracts whereby the employer exacted of employees an agreement not to join or remain a member of a union as a condition of acquiring and retaining employment deprived employees of liberty of contract contrary to due process.",
    "title": "Coppage v. Kansas",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep236/usrep236001/usrep236001.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In a small industrial town, tensions rise between local businesses and the newly formed workers' union. The union's influence is growing, and more employees are showing interest in joining its ranks. However, one of the town's major employers, a factory owner named Mr. Coppage, is staunchly against unionization.\n\nWishing to maintain a non-unionized workforce, Mr. Coppage begins to include a clause in all new employment contracts and requires existing employees to sign an addendum. These documents state that to gain or keep their jobs, workers must agree not to join the union at any point during their employment with his factory.\n\nSoon after, a worker named John Hedges, who has been with the factory since its opening but is also a union sympathizer, is pulled aside by Mr. Coppage. He is presented with the agreement and told that he must sign it or lose his job. John believes this to be an unfair choice, feeling that his right to freely associate is being infringed upon. Reluctantly, he signs to avoid immediate unemployment but later seeks legal advice, claiming his constitutional rights have been violated.\n\nThe case quickly escalates, capturing the town's attention. Both the local courts and the community are divided on the issue. Some argue that Mr. Coppage has the right to run his business as he sees fit, while others rally around John, claiming the contract infringes upon the workers' freedom of association, a right they argue is protected under the Constitution.\n\n",
    "isLaw": "true"
  },
  {
    "id": 9,
    "name": "Lefkowitz v. Turley,414 U.S. 70 (1973)",
    "year": 1973,
    "description": "New York General Municipal Law §§ 103-a and 103-b and New York Public Authorities Law §§ 2601 and 2602: New York statute providing for cancellation of public contracts and disqualification of contractors from doing business with the state for five years for refusal to waive immunity from prosecution and testify concerning state contracts.",
    "title": "Lefkowitz v. Turley",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep414/usrep414070/usrep414070.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In the state of New York, architects John Doe and Jane Smith, who frequently contract with the state for public projects, were summoned before a grand jury investigating corruption in state contracts. They were asked to testify about their dealings with the state and to waive their immunity from prosecution. Fearing self-incrimination, both refused to waive their rights and, as a result, received notice from the state that their existing contracts might be terminated and they would be barred from future state contracts for a period of five years. Doe and Smith contested this penalty as a violation of their constitutional rights, arguing that the threat of economic sanction forced them to choose between their constitutional privilege against self-incrimination and their livelihood as state contractors.",
    "isLaw": "true"
  },
  {
    "id": 10,
    "name": "Coombes v. Getz,285 U.S. 434 (1932)",
    "year": 1931,
    "description": "N/A?",
    "title": "Coombes v. Getz",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep285/usrep285434/usrep285434.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In a small office space shared by several corporations, Emma, a director, was diligently reviewing financial statements when federal agents burst in, flashing a warrant for her arrest. The agents accused her of complicity in a large-scale embezzlement scheme orchestrated by corporate officers across the multiple companies she oversaw. As Emma was handcuffed and read her rights, the agents methodically ransacked the office. They rifled through cabinets, desk drawers, and personal items, gathering stacks of corporate records, financial documents, and private correspondences.\n\nThe agents argued that Emma's role as a director made her responsible for any misappropriated funds, and the chaotic jumble of papers they confiscated would, they claimed, reveal the extent of her involvement. Emma protested, asserting that the aggressive search exceeded the bounds of legal procedure and violated her rights, as her position did not directly involve financial transactions and the office itself was neither a place of illicit business nor had it been used to directly facilitate the embezzlement. Despite her objections, the agents departed with the seized items, leaving Emma's reputable standing as a director facing serious doubt and the sanctity of her private office space violated.",
    "isLaw": "true"
  },
  {
    "id": 11,
    "name": "Cipriano v. City of Houma,395 U.S. 701 (1969)",
    "year": 1968,
    "description": "La. Rev. Stat. § 39:501 (1950): A Louisiana statute that limited the municipalities' power to issue revenue bonds so that bonds could only be issued if they were approved by a \"majority in number and amount of the [Louisiana] property taxpayers qualified to vote\" and who vote at the bond election.",
    "title": "Cipriano v. City of Houma",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep395/usrep395701/usrep395701.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In a small Louisiana town, a municipal election was scheduled to determine whether the town would issue revenue bonds for upgrading its public utility systems. According to state law, only those classified as \"property taxpayers\" were granted the right to cast a vote in this special election, effectively excluding all other residents, regardless of their voter registration status. This legal constraint meant that several town inhabitants, including individuals who were not property owners but were affected by the utilities' services and rates, were denied participation in the decision-making process that could have significant implications for their daily lives and financial responsibilities. The excluded citizens, feeling that their constitutional rights were being infringed upon, decided to challenge the legality of the state law that created this selective voting restriction.",
    "isLaw": "true"
  },
  {
    "id": 12,
    "name": "Metromedia, Inc. v. City of San Diego,453 U.S. 490 (1981)",
    "year": 1980,
    "description": "San Diego Ordinance No. 10795 (Mar. 14, 1972): San Diego, California ordinance prohibiting outdoor advertising displays except for certain onsite signs and 12 specific exceptions.",
    "title": "Metromedia",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep403/usrep403029/usrep403029.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "A city ordinance imposed strict regulations on outdoor advertising displays, banning all billboards except for certain onsite signs and 12 specific exceptions. The ordinance was intended to improve traffic safety and enhance the city's appearance. A company that owned and operated billboards challenged the ordinance, claiming it violated their First Amendment rights to free speech.\n\nScenario:\nA bustling city, renowned for its scenic beauty, implements a stringent ordinance that places a ban on all outdoor advertising displays. This new policy is intended to enhance the visual environment and ensure public safety by reducing distractions for drivers. However, an established company that specializes in outdoor advertising is directly impacted by the ban. They argue that this ordinance stifles their ability to communicate with the public and infringes upon their constitutional rights. The dispute escalates, and the case is brought before the highest legal authority, where the ordinance's fate will be decided based on constitutional principles.",
    "isLaw": "true"
  },
  {
    "id": 13,
    "name": "Ballew v. Georgia,435 U.S. 223 (1978)",
    "year": 1977,
    "description": "1890-1891 Ga. Laws, No. 278, pp. 937-38: Georgia statute providing that certain trials in criminal cases be conducted before five-person juries.",
    "title": "Ballew v. Georgia",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep435/usrep435223/usrep435223.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In the state of Georgia, an individual was brought to trial on misdemeanor charges, but the case was not heard by the usual twelve-member jury. Instead, the court, adhering to a specific state law, assembled a jury consisting of only five people. The defendant challenged the constitutionality of the five-person jury, arguing that it jeopardized the fairness of the trial and did not adequately represent the community, as mandated by the Sixth and Fourteenth Amendments of the U.S. Constitution. The case escalated through the appeals process until it reached the highest court in the land. The Supreme Court was tasked with deciding whether a jury composed of less than six members could deliver a just trial, in line with the core principles of the American legal system and the rights guaranteed under the Constitution.",
    "isLaw": "true"
  },
  {
    "id": 14,
    "name": "Board of Airport Commissioners of Los Angeles v. Jews For Jesus, Inc.,482 U.S. 569 (1987)",
    "year": 1986,
    "description": "Board of Airport Commissioners Resolution No. 13787 (1983): A resolution of the Los Angeles, California Board of Airport Commissioners banning all \"First Amendment activities\" within the \"Central Terminal Area\" at Los Angeles International Airport.",
    "title": "Board of Airport Commissioners of Los Angeles v. Jews For Jesus",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep482/usrep482569/usrep482569.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In a bustling international airport, a religious group decides to set up a booth in one of the terminals to distribute free literature and engage in peaceful conversations with travelers about their faith. The group has been a presence in the airport for years, offering assistance and spiritual guidance to those interested. However, the airport authority recently passed a regulation banning all expressive activities in the terminal, effectively creating a silence zone where even casual conversations could be subject to penalty. As the group sets up their booth, they are approached by airport security and told that they are in violation of the new airport regulation and must leave immediately or face legal action. Despite their protest that they are only exercising their right to free speech and that their activity is neither disruptive nor commercial, they are forced to dismantle their booth and leave the premises.",
    "isLaw": "true"
  },
  {
    "id": 15,
    "name": "City of Akron v. Akron Center for Reproductive Health, Inc.,462 U.S. 416 (1983)",
    "year": 1982,
    "description": "Ordinance No. 160-1978-Sections 1870.03, 1870.05(B), 1870.06(B), 1870.06(C), 1870.07, 1870.16: An ordinance of the city of Akron, Ohio regulating the practice of abortions, including requirements respecting (1) the location where abortions must be performed; (2) parental notification for certain minors seeking an abortion; (3) the information a physician must provide about the pregnancy and the abortion procedure to a patient; (4) a 24 hour waiting period for an abortion; (5) the disposal of fetal remains.",
    "title": "City of Akron v. Akron Center for Reproductive Health",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep462/usrep462416/usrep462416.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In the town of Mapleton, a new ordinance has been passed by the city council that imposes several restrictions on individuals seeking abortion services. The law includes the following provisions:\n\n1. Abortions beyond the initial stage of pregnancy must be performed within the confines of a general hospital.\n\n2. If the individual seeking an abortion is an unmarried minor under a specified age, the physician must have a legal documentation of consent from one of the individual's parents or a court authorization.\n\n3. Physicians are required to disclose detailed information about fetal development, potential health risks of the procedure, the possibility of the fetus's viability, and alternatives to abortion. The physician must also explain the risks particular to the individual's pregnancy and the abortion method to be used.\n\n4. After receiving this information and counseling, the patient must wait 24 hours before the abortion procedure can take place.\n\n5. Post-procedure, the remains of the fetus must be handled in a manner that the ordinance defines as \"humane and sanitary.\"\n\nAny violation of this ordinance is subject to legal penalties, and the ordinance is set to take effect immediately. However, local women's health clinics believe these regulations severely infringe on a woman's right to choose and plan to challenge the constitutionality of the ordinance in court.",
    "isLaw": "true"
  },
  {
    "id": 16,
    "name": "Planned Parenthood of Southeastern Pennsylvania v. Casey,505 U.S. 833 (1992)",
    "year": 1991,
    "description": "18 Pa. Cons. Stat. §§ 3209 (1990): Spousal notification provision of the Pennsylvania Abortion Control Act, prohibiting abortion for a married woman in most circumstances unless she signed a statement indicating that she had notified her husband of her intent to abort.",
    "title": "Planned Parenthood of Southeastern Pennsylvania v. Casey",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep505/usrep505833/usrep505833.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "A newly enacted state law mandates that before a married woman can obtain an abortion, she must sign a statement confirming that she has informed her husband of her decision to terminate the pregnancy. Sarah, who is in an abusive marriage, learns that she is pregnant. Her husband has been controlling and has expressed his desire for a child, but Sarah fears for her safety and the future well-being of any child in their volatile home. Desperate and afraid of her husband's reaction, Sarah feels that she cannot comply with the law's requirement to notify him. Facing the imminent law, she confides in her friend, who suggests seeking legal assistance to challenge the constitutionality of the spousal notification requirement.",
    "isLaw": "true"
  },
  {
    "id": 17,
    "name": "Delmas v. Insurance Company,81 U.S. (14 Wall.) 661 (1872)",
    "year": 1871,
    "description": "A Louisiana constitutional provision rendering unenforceable contracts, the consideration for which was Confederate money, was, because of the Contracts Clause (Art. I, § 10), inapplicable to contracts consummated before adoption of the former provision.",
    "title": "Delmas v. Insurance Company",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep081/usrep081661/usrep081661.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In the scenario, a merchant in Louisiana is sued for a debt that was originally settled using Confederate currency. The merchant defends against the lawsuit by invoking a new state constitutional provision declaring all contracts with considerations paid in Confederate money to be void and unenforceable. The creditor who is suing for the debt argues that applying this provision retroactively violates the U.S. Constitution, as it impairs the obligation of contracts previously made. \n\nAfter the case progresses through the state courts, it reaches the Supreme Court, where the justices must decide if the state's constitutional provision impermissibly interferes with obligations of contracts that were valid when they were established, under the protection of the Contracts Clause. The outcome will hinge on the application of the Contracts Clause and whether the state constitutional amendment infringes on the obligations of contracts by its retroactive invalidation of agreements using Confederate currency, which was legal tender at the time the contracts were entered into.",
    "isLaw": "true"
  },
  {
    "id": 18,
    "name": "Meek v. Pittenger,421 U.S. 349 (1975)",
    "year": 1974,
    "description": "Pa. Stat. Ann., Tit. 24, § 9-972: Pennsylvania laws authorizing direct provision to nonpublic school children of “auxiliary services”, i.e., counseling, testing, speech and hearing therapy, etc., and loans to the nonpublic schools for instructional material and equipment.",
    "title": "Meek v. Pittenger",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep421/usrep421349/usrep421349.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "The Commonwealth of Etherton mandates that all schools provide auxiliary services to assist children with special educational needs. Among these services are psychological evaluations, speech therapy, and tutoring for learning disabilities. These services are available to all public school students. Recently, a new law expanded the program, allowing private school students to access the same support. However, most of these private institutions have a religious affiliation, and the new law stipulates that the services must be delivered on the premises of the private schools by state-employed educators.\n\nIn the town of Libertyville, a debate erupts. Some residents argue that this law shows the government's neutrality by treating all students equally, regardless of where they attend school. Others, however, feel that this direct involvement of state resources in religious schools blurs the line separating church and state, potentially influencing the secular services with religious doctrine. As the discussions escalate, a parent coalition files a lawsuit, contending that the new law intrudes on the secular education system and fosters an unconstitutional entanglement between the government and religious institutions. The case makes its way to the highest court, setting the stage for a landmark decision on the separation of church and state in education.",
    "isLaw": "true"
  },
  {
    "id": 19,
    "name": "Railroad v. Husen,95 U.S. 465 (1878)",
    "year": 1877,
    "description": "A Missouri act prohibiting the bringing of cattle into the state between March and November.",
    "title": "Railroad v. Husen",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep095/usrep095465/usrep095465.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep294330/",
    "scenario": "In the state of Missouri, lawmakers have passed a regulation stating that from March to November each year, no individual or company is allowed to bring in or transport cattle from neighboring regions, known for certain breeds known as Texas, Mexican, or Indian cattle, due to the fear of spreading a cattle disease commonly called Spanish or Texas fever. The law imposes significant liabilities on both natural persons and transportation companies for any cattle brought in, even if just passing through the state without unloading, and regardless of whether the cattle are actually diseased. This has caused uproar among cattle farmers and transportation businesses alike, claiming the law severely disrupts inter-state commerce and violates their constitutional rights.",
    "isLaw": "true"
  },
  {
    "id": 20,
    "name": "Walling v. Michigan,116 U.S. 446 (1886)",
    "year": 1886,
    "description": "A Michigan law taxing nonresidents soliciting sale of foreign liquors to be shipped into the state.",
    "title": "Walling v. Michigan",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep116/usrep116446/usrep116446.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep116446/",
    "scenario": "In the state of Michigan, individuals traveling within the state on behalf of out-of-state liquor companies found themselves facing a unique tax. These tax laws required them, as nonresidents soliciting sales of liquors not produced in Michigan, to pay a hefty sum for the privilege of conducting their business. If they were caught selling or taking orders for such liquors without having paid this tax and without a receipt proving payment, they risked a misdemeanor charge, fines, or even imprisonment. Meanwhile, local sellers and solicitors, representing liquors made within Michigan, operated under different rules with lower taxes. This discriminatory tax practice put the out-of-state businesses and their agents at a significant disadvantage, raising important questions about its constitutionality and the state's power over commerce.",
    "isLaw": "true"
  },
  {
    "id": 21,
    "name": "McCracken v. Hayward,43 U.S. (2 How.) 608 (1844)",
    "year": 1844,
    "description": "An Illinois mortgage moratorium statute that, when applied to a mortgage executed prior to its passage, diminished remedies of the mortgage lender by prohibiting consummation of a foreclosure unless the foreclosure price equaled two-thirds of the value of the mortgaged property.",
    "title": "McCracken v. Hayward",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep043/usrep043608/usrep043608.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep116446/",
    "scenario": "A local farmer, Joseph, had taken out a mortgage on his farm with the Springfield State Bank in Illinois before a specific law was passed. Under the original mortgage terms, if Joseph defaulted, the bank could foreclose on the property and sell it to the highest bidder to recoup their losses.\n\nHowever, Illinois passed a law stating that no property could be sold for less than two-thirds of its appraised value, even under foreclosure circumstances. This law was specifically designed to protect property owners from losing their property for a pittance in tough economic times.\n\nJoseph eventually defaulted on his mortgage, and the bank moved to foreclose on the farm. At the auction, bids fell short of the two-thirds appraised value threshold set by the new law. Invoking this law, the state court halted the sale.\n\nThe Springfield State Bank challenged the new law, arguing that it unconstitutionally interfered with the terms of the mortgage contract, which was agreed upon before the law was enacted. The case escalated to the Supreme Court, which had to determine whether the Illinois law, when applied retroactively to existing mortgages, was unconstitutional.",
    "isLaw": "true"
  },
  {
    "id": 22,
    "name": "Cleveland Board of Education v. LaFleur,414 U.S. 632 (1974)",
    "year": 1973,
    "description": "Rule of Board of Education of Cleveland, Ohio requiring \"every pregnant school teacher to take maternity leave without pay, beginning five months before the expected birth of her child\" and to not \"return to work until the beginning of the next regular school semester which follows the date when her child attains the age of three months\"; School Board of Chesterfield County, Virginia regulation requiring a \"pregnant teacher leave work at least four months prior to the expected birth of her child.\"",
    "title": "Cleveland Board of Education v. LaFleur",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep414/usrep414632/usrep414632.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep158601/",
    "scenario": "At Monroe Public School, a beloved teacher, Mrs. Thompson, disclosed her pregnancy to the administration, expecting to continue her duties well into her term. However, she soon found out that the school had a strict, inflexible policy. It mandated that pregnant teachers take unpaid leave five months prior to their expected due date, and they were not allowed to return to work until the semester after their child turned three months old. Submitting to the policy meant Mrs. Thompson had to leave her class mid-year, which she felt was unnecessary as she was in good health and felt capable of working longer. She decided to challenge this policy, arguing that it was an unreasonable, blanket rule that didn't evaluate her individual health situation or her dedication to ensuring a smooth transition for her students. Her fight against the policy highlighted the importance of personal liberty and the arbitrary nature of the school's rule. Mrs. Thompson's case became a significant turning point in the protection of workers' rights, especially for pregnant employees, in the public educational system.",
    "isLaw": "true"
  },
  {
    "id": 23,
    "name": "Lunding v. New York Tax Appeals Tribunal,522 U.S. 287 (1998)",
    "year": 1997,
    "description": "N.Y. Tax Law § 631(b)(6): New York statute that denied nonresidents, but not residents, an income tax deduction for alimony payments.",
    "title": "Lunding v. New York Tax Appeals Tribunal",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep522/usrep522287/usrep522287.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep158601/",
    "scenario": "In a state known for its diverse population and bustling economy, a couple, who lived just across the state border, found themselves entangled in a tax dilemma. The wife, a successful realtor, and the husband, a corporate lawyer, both had flourishing careers. The husband, however, paid a significant sum in alimony to his ex-wife, who lived in the same state as him.\n\nOne year, the couple earned a substantial portion of their income from various projects in the neighboring state. As responsible citizens, they filed a nonresident income tax return for that state. Yet, when they attempted to deduct the alimony payments from their taxable income, the tax authorities denied the deduction, citing a peculiar state law.\n\nUnfazed, the couple decided to challenge this law, which, in their eyes, unfairly discriminated against nonresidents. They argued that while residents of that state could deduct alimony payments, nonresidents could not, despite earning income and paying taxes there. The couple felt this was a clear violation of their rights, and the case eventually found its way to the supreme court of the land.\n\nThe highest court, siding with the couple, declared the contentious state law unconstitutional. The court reasoned that the law unjustly targeted nonresidents and failed to provide a substantial justification for the discrimination. This landmark decision sent ripples through the tax community, inspiring nonresidents in similar situations to seek equal treatment under the law.",
    "isLaw": "true"
  },
  {
    "id": 24,
    "name": "Bendix Autolite Corp. v. Midwesco Enterprises, Inc.,486 U.S. 888 (1988)",
    "year": 1987,
    "description": "Ohio Rev. Code Ann. § 2305.15 (Supp. 1987): An Ohio law that imposes a 4-year statute of limitations in actions for breach of contract or fraud, but tolls the statute for any period that a person or corporation is not \"present\" in the state.",
    "title": "Bendix Autolite Corp. v. Midwesco Enterprises",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep486/usrep486888/usrep486888.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep158601/",
    "scenario": "In the state of Ohio, a small business owner, Dale, has a dispute with a technology provider, Intech Inc., a company based in neighboring Pennsylvania. Several years ago, Intech had installed a specialized software system in Dale's local retail outlet. Over time, Dale noticed that the software failed to perform as promised, leading to significant sales and data losses. Believing Intech was at fault, Dale decided to sue for damages.\n\nHowever, by the time Dale gathered enough evidence to build a case, the 4-year statute of limitations had almost expired. Dale rushed to file the lawsuit in an Ohio court. Intech, however, argued that the statute of limitations should not apply since they did not have a physical presence in Ohio nor had they appointed an agent for service of process in the state. Ohio law seemed to support Intech's claim by tolling the limitations period for entities not \"present\" within the state.\n\nDale contended that this was unfair, as Intech had conducted business in Ohio through the installation of the software and should not evade responsibility due to a lack of physical presence. Dale's lawyer argued that the Ohio law was unconstitutional because it impeded the proper functioning of interstate commerce by laying an unfair burden on out-of-state businesses, potentially forcing them to expose themselves to Ohio's general jurisdiction indefinitely. The court had to decide whether to dismiss the case based on the statute of limitations or acknowledge the constitutional challenge to the Ohio law.",
    "isLaw": "true"
  },
  {
    "id": 25,
    "name": "United States v. Robel,389 U.S. 258 (1967)",
    "year": 1967,
    "description": "Subversive Activities Control Act of 1950, § 5(a)(1)(D), 64 Stat. 992: Statute prohibited anyone who was a member of a registered Communist-action organization from working in any defense facility.",
    "title": "United States v. Robel",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep389/usrep389258/usrep389258.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep158601/",
    "scenario": "In the United States, a Supreme Court ruling declared a specific law unconstitutional, stirring significant debate on national security and individual liberties. The contentious law prohibited any member of a designated Communist organization from being employed at any national defense facility. Despite assertions of the law's necessity for protecting against espionage and sabotage, critics argued it violated the constitutional right to free association and due process. The Supreme Court's decision has reignited discussions on finding a balance between national security interests and the protection of fundamental constitutional freedoms.",
    "isLaw": "true"
  },
  {
    "id": 26,
    "name": "Dombrowski v. Pfister,380 U.S. 479 (1965)",
    "year": 1964,
    "description": "La. Stat. Ann. §§ 14:359(5), 14:364(7): Louisiana statute defining subversive organization and making it a criminal offense to fail to register as a member of a subversive organization.",
    "title": "Dombrowski v. Pfister",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep380/usrep380479/usrep380479.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep158601/",
    "scenario": "In a small Louisiana town, tensions rise as a local civil rights group gains momentum, advocating for equality and justice. The group's activities draw the ire of state officials who perceive their actions as threatening to the state's social order. Seeking to quell this perceived threat, the state officials invoke a controversial law, requiring the civil rights activists to register as members of a \"subversive organization.\"\n\nThe group's leader, a passionate advocate named James, refuses to comply, arguing that the law violates their constitutional rights to free speech and free association. State authorities respond by arresting James and raiding the group's headquarters, confiscating materials and records under the auspices of enforcing the law.\n\nAs news of the arrests spreads, a legal battle ensues. The civil rights group files a lawsuit seeking to block further prosecutions under the law, claiming it is overly broad and suppresses their ability to express dissent and organize peacefully.\n\nThe case swiftly moves through the courts, ultimately reaching the Supreme Court. The Justices are faced with determining whether the law in question infringes upon the First Amendment rights of the activists and whether the state's actions constitute an unconstitutional application of power. The high stakes of the case reverberate through the community, as everyone awaits a ruling that could significantly impact the future of free expression and the right to dissent in the United States.",
    "isLaw": "true"
  },
  {
    "id": 27,
    "name": "Lee v. International Society for Krishna Consciousness, Inc.,505 U.S. 830 (1992)",
    "year": 1991,
    "description": "Port Authority of New York and New Jersey restriction that banned the distribution of literature in airport terminals.",
    "title": "Lee v. International Society for Krishna Consciousness",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep505/usrep505672/usrep505672.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep158601/",
    "scenario": "In a bustling airport terminal of a major city, where travelers from all over the world converge, an organization sets up a collection station. Their goal is to distribute literature and raise funds for their religious and humanitarian efforts. However, airport authorities have instituted a strict policy: any repetitive solicitation of money or distribution of literature within the airport terminal is strictly forbidden. The organization argues that this policy violates their right to free speech and expression as protected under the Constitution, sparking a heated legal battle that ascends to the nation's highest court. As travelers hustle past, the scene is set for a constitutional showdown; the rights of individuals and groups to share their message in what they deem a public forum clashes with a government authority's regulation aimed at maintaining order and the primary function of the airport: transportation. Which constitutional articles and amendments will come into play, as the nation watches the legal arguments unfold?",
    "isLaw": "true"
  },
  {
    "id": 28,
    "name": "Moore v. Illinois,408 U.S. 786 (1972)",
    "year": 1971,
    "description": "Illinois statute providing for imposition of the death penalty.",
    "title": "Moore v. Illinois",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep434/usrep434220/usrep434220.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep434220/",
    "scenario": "A man is arrested for a violent crime and brought to a preliminary hearing in court. The victim is present and, after being told by police that she is going to view a suspect and hearing the suspect's name, identifies the man as her assailant in front of the judge. However, the man has no lawyer to represent him during this process. Later, when he finally gets a lawyer, the attorney attempts to challenge the validity of the identification, but the courts deny the motion. At the trial, the victim testifies that she identified the man during the hearing and he is ultimately convicted. The man's defense claims that his constitutional rights were violated because he did not have legal representation during the critical pretrial identification.",
    "isLaw": "true"
  },
  {
    "id": 29,
    "name": "Groppi v. Wisconsin,400 U.S. 505 (1971)",
    "year": 1970,
    "description": "Wis. Stat. § 971.22 (effective July 1, 1970): Wisconsin statute provided in essence that only those defendants charged with felonies could move to change venue on grounds of impartiality at trial.",
    "title": "Groppi v. Wisconsin",
    "pdfLink": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep400/usrep400505/usrep400505.pdf",
    "pageLink": "https://www.loc.gov/resource/usrep.usrep434220/",
    "scenario": "In a small town, a local baker, known for his participation in controversial protests, is arrested and charged with a misdemeanor for obstructing traffic during a demonstration. The incident garners significant attention and divides the community, as some see him as a troublemaker, while others view him as a hero standing up for important issues. Due to the extensive media coverage and the heated public debate, the baker's attorney requests a change of venue for the trial, arguing that pervasive local bias could prevent a fair and impartial jury from being seated. However, under state law, change of venue requests are not granted for misdemeanor charges. The trial proceeds in the local court, and the baker is convicted. Concerned about the influence of the divided community sentiment on the jury's impartiality, the case escalates to higher courts to determine if the baker's constitutional rights were violated.",
    "isLaw": "true"
  }
]